I went ahead and configured the provider to be used locally like [this](https://stackoverflow.com/questions/68182628/terraform-use-local-provider-plugin) answer describes.

---

`terraform init`:

```
$ terraform init
Initializing modules...
- minikube-cluster in ../../modules/minikube-cluster

Initializing the backend...

Initializing provider plugins...
- Finding terraform.local/local/minikube versions matching "1.0.0"...
- Finding hashicorp/kubernetes versions matching "2.13.1"...
- Finding hashicorp/helm versions matching "2.6.0"...
- Finding hashicorp/null versions matching "3.1.1"...
- Finding hashicorp/local versions matching "2.2.3"...
- Installing terraform.local/local/minikube v1.0.0...
- Installed terraform.local/local/minikube v1.0.0 (unauthenticated)
- Installing hashicorp/kubernetes v2.13.1...
- Installed hashicorp/kubernetes v2.13.1 (signed by HashiCorp)
- Installing hashicorp/helm v2.6.0...
- Installed hashicorp/helm v2.6.0 (signed by HashiCorp)
- Installing hashicorp/null v3.1.1...
- Installed hashicorp/null v3.1.1 (signed by HashiCorp)
- Installing hashicorp/local v2.2.3...
- Installed hashicorp/local v2.2.3 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

╷
│ Warning: Incomplete lock file information for providers
│ 
│ Due to your customized provider installation methods, Terraform was forced to calculate lock file checksums locally for the following providers:
│   - terraform.local/local/minikube
│ 
│ The current .terraform.lock.hcl file only includes checksums for linux_amd64, so Terraform running on another platform will fail to install these providers.
│ 
│ To calculate additional checksums for another platform, run:
│   terraform providers lock -platform=linux_amd64
│ (where linux_amd64 is the platform to generate)
╵
```

---

`terraform plan`:
```
$ terraform plan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.minikube-cluster.minikube_cluster.default will be created
  + resource "minikube_cluster" "default" {
      + addons                     = (known after apply)
      + apiserver_ips              = (known after apply)
      + apiserver_name             = "minikubeCA"
      + apiserver_names            = (known after apply)
      + apiserver_port             = 8443
      + base_image                 = "gcr.io/k8s-minikube/kicbase:v0.0.33@sha256:73b259e144d926189cf169ae5b46bbec4e08e4e2f2bd87296054c3244f70feb8"



       client_key                 = (sensitive value)
      + cluster_ca_certificate     = (sensitive value)
      + cluster_name               = "opencomply-local-development"
      + container_runtime          = "docker"ve value)
      + cpus                       = 2
      + delete_on_failure          = false
      + disable_driver_mounts      = false
      + disk_size                  = 20000
      + dns_domain                 = "cluster.local"
      + dns_proxy                  = false
      + driver                     = "kvm2"
      + embed_certs                = false
      + extra_disks                = 0
      + force                      = false
      + host                       = (known after apply)
      + host_dns_resolver          = true
      + host_only_cidr             = "192.168.59.1/24"
      + host_only_nic_type         = "virtio"
      + hyperkit_vsock_ports       = (known after apply)
      + hyperv_use_external_switch = false
      + id                         = (known after apply)
      + insecure_registry          = (known after apply)
      + iso_url                    = (known after apply)
      + keep_context               = false
      + kvm_gpu                    = false
      + kvm_hidden                 = false
      + kvm_network                = "default"
      + kvm_numa_count             = 1
      + kvm_qemu_uri               = "qemu:///system"
      + memory                     = 6000
      + mount                      = false
      + mount_string               = "/Users"
      + namespace                  = "default"
      + nat_nic_type               = "virtio"
      + nfs_share                  = (known after apply)
      + nfs_shares_root            = "/nfsshares"
      + no_vtx_check               = false
      + nodes                      = 1
      + ports                      = (known after apply)
      + registry_mirror            = (known after apply)
      + service_cluster_ip_range   = "10.96.0.0/12"
      + ssh_port                   = 22
      + ssh_user                   = "root"
      + vm                         = false
      + wait_timeout               = 600
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

---

`terraform apply`:
```
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.minikube-cluster.minikube_cluster.default will be created
  + resource "minikube_cluster" "default" {
      + addons                     = (known after apply)
      + apiserver_ips              = (known after apply)
      + apiserver_name             = "minikubeCA"
      + apiserver_names            = (known after apply)
      + apiserver_port             = 8443
      + base_image                 = "gcr.io/k8s-minikube/kicbase:v0.0.33@sha256:73b259e144d926189cf169ae5b46bbec4e08e4e2f2bd87296054c3244f70feb8"
      + cache_images               = true
      + cert_expiration            = 26280
      + client_certificate         = (sensitive value)
      + client_key                 = (sensitive value)
      + cluster_ca_certificate     = (sensitive value)
      + cluster_name               = "opencomply-local-development"
      + container_runtime          = "docker"
      + cpus                       = 2
      + delete_on_failure          = false
      + disable_driver_mounts      = false
      + disk_size                  = 20000
      + dns_domain                 = "cluster.local"
      + dns_proxy                  = false
      + driver                     = "kvm2"
      + embed_certs                = false
      + extra_disks                = 0
      + force                      = false
      + host                       = (known after apply)
      + host_dns_resolver          = true
      + host_only_cidr             = "192.168.59.1/24"
      + host_only_nic_type         = "virtio"
      + hyperkit_vsock_ports       = (known after apply)
      + hyperv_use_external_switch = false
      + id                         = (known after apply)
      + insecure_registry          = (known after apply)
      + iso_url                    = (known after apply)
      + keep_context               = false
      + kvm_gpu                    = false
      + kvm_hidden                 = false
      + kvm_network                = "default"
      + kvm_numa_count             = 1
      + kvm_qemu_uri               = "qemu:///system"
      + memory                     = 6000
      + mount                      = false
      + mount_string               = "/Users"
      + namespace                  = "default"
      + nat_nic_type               = "virtio"
      + nfs_share                  = (known after apply)
      + nfs_shares_root            = "/nfsshares"
      + no_vtx_check               = false
      + nodes                      = 1
      + ports                      = (known after apply)
      + registry_mirror            = (known after apply)
      + service_cluster_ip_range   = "10.96.0.0/12"
      + ssh_port                   = 22
      + ssh_user                   = "root"
      + vm                         = false
      + wait_timeout               = 600
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.minikube-cluster.minikube_cluster.default: Creating...
╷
│ Error: Failed to start host: driver start: ensuring active networks: getting libvirt connection: connecting to libvirt socket: virError(Code=5, Domain=0, Message='no connection driver available for URI 'qemu' does not include a driver name')
│ 
│   with module.minikube-cluster.minikube_cluster.default,
│   on ../../modules/minikube-cluster/cluster.tf line 3, in resource "minikube_cluster" "default":
│    3: resource "minikube_cluster" "default" {
│ 
╵

```